🚀&nbsp; env0 had composed a PR Plan for environment [github PR example-1531](https://app.env0.com/p/6e0e8ba6-6399-481f-88aa-04dbab995957/environments/5ae02f11-3797-4799-9fda-fe6f5b3b2df4):
```
Plan: 3 to add, 0 to change, 0 to destroy.
```

<details>

<summary>Plan Details</summary>

```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.id will be created
  + resource "random_id" "id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # random_id.id3 will be created
  + resource "random_id" "id3" {

      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # random_id.id4 will be created
  + resource "random_id" "id4" {
      + b64_std     = (known after apply)

      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Warning: Value for undeclared variable

  on env0.auto.tfvars.json line 1:
   1: {"region":"us-east-1"}
```
</details>

  
[Full Plan Logs on env0](https://app.env0.com/p/6e0e8ba6-6399-481f-88aa-04dbab995957/environments/5ae02f11-3797-4799-9fda-fe6f5b3b2df4/deployments/01655f7e-17d7-44f5-a074-1813cc1cad42)